[
    {
        "department_id": "001",
        "department_name": "Artificial Intelligence and Data Science (AI&DS)",
        "department_image": "/static/images/department_data/aids.jpg",
        "department_quotes": "Empowering innovation through data-driven intelligence.",
        "vision": "To achieve value based education and bring idealistic, ethical engineers to meet the thriving trends and technology in the field of Artificial Intelligence and Data Science",
        "mission": [
            "To engage students with the core competence to solve real world problems using Artificial Intelligence.",
            "To enlighten students into technically proficient engineers through innovation in Data Science.",
            "To involve students with industry collaboration, career guidance and leadership skills.",
            "To mould students as ethical professionals to bring morals to individual and society."
        ],
        "about_department": ["Department of Artificial Intelligence aims to produce computing graduates with high potency, apply, design and develop systems to pertain and to integrate both software and hardware devices, utilize modern approaches in programming and problem solving techniques."," The Department was established in the year 2020 with the main objective of providing quality education in the field of Engineering and Technology."," It is recognized as nodal center under Anna University. The Department has proved to be a center of excellence in Academic, Sponsored research and Continuing Education Programme."],
        "newsletter_path": "/static/docs/dapartment_data/aids_newsletter.pdf"
    },
    {
        "department_id": "002",
        "department_name": "Automobile Engineering (AUTO)",
        "department_image": "/static/images/department_data/auto.jpg",
        "department_quotes": "Innovating the future of technology.",
        "vision": "To excel in computer science education, research, and innovation.",
        "mission": [
            "Deliver quality education in computer science engineering.",
            "Foster research in emerging fields of technology.",
            "Build industry-ready professionals with strong ethical values."
        ],
        "newsletter_path": "/static/docs/dapartment_data/auto_newsletter.pdf",
        "about_department": ["Department of Artificial Intelligence aims to produce computing graduates with high potency, apply, design and develop systems to pertain and to integrate both software and hardware devices, utilize modern approaches in programming and problem solving techniques."," The Department was established in the year 2020 with the main objective of providing quality education in the field of Engineering and Technology."," It is recognized as nodal center under Anna University. The Department has proved to be a center of excellence in Academic, Sponsored research and Continuing Education Programme."]
    },
    {
        "department_id": "003",
        "department_name": "Chemistry ",
        "department_image": "/static/images/department_data/chem.jpg",
        "department_quotes": "Innovating chemistry, transforming the future.",
        "vision": "To be a world-renowned department of chemistry, known for its superior teaching, research, and innovation, and to cultivate a community of critical and creative thinkers capable of tackling the intricate chemical and environmental problems of the twenty-first century.",
        "mission": [
            "Provide strong undergraduate and graduate programs that develop critical thinking, practical skills, and deep theoretical knowledge.",
            "Conduct cutting-edge research in materials, environmental solutions, and sustainable energy.",
            "Support industries, government, and communities while fostering innovation, entrepreneurship, and leadership."
        ],
        "newsletter_path": "/static/docs/dapartment_data/chem_newsletter.pdf",
        "about_department": ["The Chemistry department is a fascinating field that combines principles from chemistry and engineering to develop innovative solutions for various industries.  Development of new materials with specific properties for applications in energy, aerospace, biomedical, and other fields.Research on sustainable energy sources, energy storage, and environmental remediation technologies.Design and optimization of chemical processes for large-scale production of chemicals, fuels, and pharmaceuticals. Development of corrosion-resistant materials and coatings for various industries."]
    },
    {
        "department_id": "004",
        "department_name": "Civil Engineering (CIVIL)",
        "department_image": "/static/images/department_data/civil.jpg",
        "department_quotes": "The road to success is always under construction",
        "vision": "Department of Civil Engineering aims to transform the students, through theory and practice, into competitive civil engineers, who will provide smart solutions for the futuristic sustainable development of the nation with human values.",
        "mission": [
            "To transform the students into industry ready civil engineering graduates.",
            "To inculcate a spirit of learning for pursuing higher studies with global outreach.",
            "To promote research in civil engineering to achieve sustainability.",
            "To facilitate conducive environment for entrepreneurship development.",
            "To provide industry and society based solutions through innovation and creativity"
        ],
        "newsletter_path": "/static/docs/dapartment_data/civil_newsletter.pdf",
        "about_department": ["Civil Engineering, the Mother of all Engineering Disciplines, its Sons and Daughters, the Young Civil Engineers are the Nation Builders for sustaining Civilization anywhere in the World and Universe.Starting from 2007, Department of Civil Engineering joined in contributing towards nation building through our Graduate Civil Engineers.","The BE Civil Engineering program of VEC is continuously accredited by NBA since 2015. So far 32 graduates from the Department have been placed in State and Central Government jobs (IRS, IOCL, Revenue, Police, PWD, Highways, Water Resources, Buildings, CMDA, Local Administration...) and also in many other countries like UK, USA, Canada, Singapore, Dubai, Australia, etc. in various roles and positions.","To achieve this, the Department is equipped with sophisticated laboratories and field oriented teaching and training. About 85% of students are placed in Core & IT companies (45+ Core Companies & 20+ IT companies). Around 200+ Students opted for higher studies in India & Foreign Universities through GATE, GRE & GMAT. Currently under Autonomous mode, the curriculum is further enriched to facilitate student community to reach greater heights and zeniths."]
    },      
    {
        "department_id": "005",
        "department_name": "Computer Science & Engineering (CSE)",
        "department_image": "/static/images/department_data/cse.jpg",
        "department_quotes": "To build strategic partnerships with industry to encourage collaborative innovation, facilitate knowledge exchange, and align educational efforts with real-world demands",
        "vision": "To provide quality education aimed at cultivating exceptionally skilled technologists and entrepreneurs with a global footprint, supported by strong ethical values, and inventive thinking in the field of Computer Science and Engineering, tailored to fulfill both industrial demands and societal aspirations",
        "mission": [
            "To focus on delivering education that is both affordable and of high quality, ensuring that it aligns with current industry needs. ",
            "To strive for excellence in teaching and learning processes by integrating strong ethical values, inventive thinking, and a focus on entrepreneurship.",
            "To create an environment that encourages innovation supports multidisciplinary research endeavors, and cultivates professionals focused on research excellence in Computer Science and Engineering. ",
            "To enhance educational outcomes by nurturing entrepreneurship, integrating project-based learning, and aligning educational efforts with both industrial demands and societal aspirations."
        ],
        "newsletter_path": "/static/docs/dapartment_data/cse_newsletter.pdf",
        "about_department": ["Established in 1995, the Department of Computer Science and Engineering at our institution has been dedicated to providing high-quality education to 240 students. Our mission is to equip young minds with the knowledge and skills necessary to excel in the field of IT and drive organizational success.To achieve this, we offer a comprehensive curriculum that incorporates the latest technologies, collaborative projects, research associations, and hands-on training through semester-long internships and live industry problem-solving. Our program also features flexible electives, open electives, honors, and minor degrees, promoting an interdisciplinary approach that prepares students to thrive in a rapidly evolving tech landscape."]
    },
    {
        "department_id": "006",
        "department_name": "Computer Science and Engineering (CYBER SECURITY)",
        "department_image": "/static/images/department_data/cyber.jpg",
        "department_quotes": "Securing tomorrows technology with todays intelligence",
        "vision": "To provide comprehensive coverage and Hands-on Experience to enrich the knowledge of the student and also focus on Industry standards. To grab the attention of students in the area of Research, Critical Thinking and Problem-Solving",
        "mission": [
            "To make the students understand basics of Cryptography and Network Security.",
            "To make the students robust in maintaining the Confidentiality, Integrity and Availability of a data.",
            "To understand various protocols for network security to protect against the threats in the network",
            "To equip students in Ethical Hacking and Penetration Testing"
        ],
        "newsletter_path": "/static/docs/dapartment_data/cyber_newsletter.pdf",
        "about_department": ["The Computer Science and Engineering (Cyber Security) course is a specialized branch of CSE that focuses on securing digital systems, networks, and data from cyber threats. It combines core computer science principles with specialized knowledge in Cyber Security. This program provides a strong foundation in computer science along with in-depth training in Cyber Security techniques, Ethical hacking, Cryptography, and Network Security. The curriculum is designed to equip students with skills to detect, prevent, and respond to cyber threats. It is a highly specialized and rewarding field with excellent career prospects. With Cyber threats increasing worldwide, there is a huge demand for skilled Cyber Security professionals. By combining technical expertise, ethical hacking skills, and knowledge of cyber laws, students can build a successful career in Cyber Security."]
    },
    {
        "department_id": "007",
        "department_name": "Electrical & Electronics Engineering (EEE)",
        "department_image": "/static/images/department_data/eee.jpg",
        "department_quotes": "Electrify, Energize, Enlighten. Driving the future with electric brilliance!",
        "vision": "Imparting high quality education and grooming of competent Electrical and Electronics Engineers to cater to the global needs of Academics, Industry and Society",
        "mission": [
            "To impart knowledge, skills and attitudes for developing engineers to compete at global level with dedication, determination and distinction.",
            "To motivate creativity, kindle innovation and build leadership.",
            "To promote self-learning and teamwork and to make them industry ready graduates.",
            "To involve the faculty and students in research and consultancy for the benefit of institute, industry and society."
        ],
        "newsletter_path": "/static/docs/dapartment_data/eee_newsletter.pdf",
        "about_department": ["The department of Electrical and Electronics Engineering at Velammal Engineering College with its rich and traditional academic ambiance targets both the theory and the practical applications of engineering and technology to handle global challenges of the present and future scenarios.","The department is celebrating 25 years of academic excellence since 1995. All the departmental activities are NBA Accredited since 2002 and also ISO certified.","With academic autonomy, it offers variety of courses across a wide spectrum of specialized topics in UG, PG and PhD level under choice-based credit system in concurrence with the modern technological advancements and industrial requirements."]
    },
    {
        "department_id": "008",
        "department_name": "Electronics & Instrumentation Engineering (EIE)",
        "department_image": "/static/images/department_data/eie.jpg",
        "department_quotes": "Empowering minds with the knowledge of electronics, instrumentation, and control, we pave the path for innovation and leadership, nurturing talents for a globally competitive future.",
        "vision": "To impart knowledge base and skill sets in the field of Electronics and Instrumentation by providing learning ambience for academic and research activities, leading to global competence.",
        "mission": [
            "To provide students with strong foundation in electronics, instrumentation and control engineering.",
            "To enhance the core competency, leadership and managerial skills of the students to cater the industrial needs.",
            "To cultivate adaption of ethics, morality and healthy practices in professional life towards serving the society and the country.",
            "To facilitate graduate with Entrepreneurship skills.",
            "To encourage faculty members and students to engage themselves in multidisciplinary research endeavors and keep abreast of current trends through continuing education."
        ],
        "newsletter_path": "/static/docs/dapartment_data/eie_newsletter.pdf",
        "about_department": ["Department of Electronics & Instrumentation Engineering is an advanced branch which deals with the application of existing scientific knowledge in electronics, instrumentation, measurements, control and automation of processes."," Started in the year 2002, the department of Electronics and Instrumentation Engineering is running a four year under graduate program accredited by NBA.","From inception, the department has grown in leaps and bounds with the state of art of infrastructure and lab facilities.","The program provides an opportunity to learn the technical skills thereby enhancing their technical competency and leadership qualities.","The graduates are having wide scope to get career opportunities in major process, energy, oil and natural gas industries as well as research opportunities in highly ranked institutes and universities within and outside the country."]
    },
    {
        "department_id": "009",
        "department_name": "Electronics and Communication Engineering (ECE)",
        "department_image": "/static/images/department_data/ece.jpg",
        "department_quotes": "Engineering the tools of the future.",
        "vision": "To achieve excellence in mechanical engineering education and research.",
        "mission": [
            "Deliver comprehensive knowledge of mechanical systems.",
            "Promote research in advanced manufacturing and materials.",
            "Prepare students for global challenges in engineering."
        ],
        "newsletter_path": "/static/docs/dapartment_data/ece_newsletter.pdf",
        "about_department": ["Department of Artificial Intelligence aims to produce computing graduates with high potency, apply, design and develop systems to pertain and to integrate both software and hardware devices, utilize modern approaches in programming and problem solving techniques."," The Department was established in the year 2020 with the main objective of providing quality education in the field of Engineering and Technology."," It is recognized as nodal center under Anna University. The Department has proved to be a center of excellence in Academic, Sponsored research and Continuing Education Programme."]
    },
    {
        "department_id": "010",
        "department_name": "English ",
        "department_image": "/static/images/department_data/eng.jpg",
        "department_quotes": "Mastering the art of communication: one lesson at a time",
        "vision": "To empower engineering students with effective communication skills, critical thinking, and creative expression, enabling them to excel as global professionals, innovators, and leaders, while fostering a culture of linguistic excellence, intellectual curiosity, and lifelong learning.”",
        "mission": [
            "To develop engineering students' communication, critical thinking, and soft skills through innovative teaching, mentoring, and assessment methods, enabling them to articulate ideas, collaborate effectively, and succeed in their academic, professional, and personal pursuits."
        ],
        "newsletter_path": "/static/docs/dapartment_data/eng_newsletter.pdf",
        "about_department": ["The Department of English has been in a dynamic existence since the inception of the college equipping the budding engineers with commendable communication skills in order to meet the ever growing demands of industry, business, public and private organizations as well as academic and human services. The Department boasts of practical curricula with a high degree of professional relevance, enabling students to face real time challenges. The faculty of the department are known for their committed teaching, individualized explorative bent of mind and close mentoring. We are delighted to extend our academic support to the institution in all its recognitions."]
    },
    {
        "department_id": "011",
        "department_name": "Information Technology (IT)",
        "department_image": "/static/images/department_data/it.jpg",
        "department_quotes": "Communicating the world with clarity and creativity.",
        "vision": "Empowering innovation through cutting-edge technology solutions, transforming learning experiences with digital excellence, driving operational efficiency through strategic IT initiatives, and securing a dynamic digital future.",
        "mission": [
            "To continuously research, develop, and implement innovative technology solutions that empower academic and administrative excellence, fostering a culture of creativity and problem-solving.",
            "o seamlessly integrate digital technologies into every facet of the learning experience, from classrooms to online platforms, ensuring accessibility, engagement, and effectiveness in education.",
            "To engage with the wider community, including alumni, local businesses, and societal stakeholders, to promote digital literacy, foster technology adoption, and contribute to the socio-economic development.",
            "To cultivate a dynamic environment that encourages continual growth, entrepreneurial   spirit, cohesive teamwork, exemplary professionalism, and leadership with a strong sense of social responsibility."
        ],
        "newsletter_path": "/static/docs/dapartment_data/it_newsletter.pdf",
        "about_department": ["Department of Artificial Intelligence aims to produce computing graduates with high potency, apply, design and develop systems to pertain and to integrate both software and hardware devices, utilize modern approaches in programming and problem solving techniques."," The Department was established in the year 2020 with the main objective of providing quality education in the field of Engineering and Technology."," It is recognized as nodal center under Anna University. The Department has proved to be a center of excellence in Academic, Sponsored research and Continuing Education Programme."]
    },
    {
        "department_id": "012",
        "department_name": "Mathematics",
        "department_image": "/static/images/department_data/math.jpg",
        "department_quotes": "Mathematics is a powerful motivator for everyone, as its journey begins with zero and stretches endlessly into infinity.",
        "vision": "To promote a deep understanding and appreciation of mathematics among engineering students, empowering them to become innovative problem-solvers, critical thinkers and leaders in their fields.",
        "mission": [
                "Empower students with a strong academic foundation for future success.",
                "Foster problem-solving, leadership, and teamwork skills." ,
                "Prepare students for advanced studies and thriving careers."
        ],
        "newsletter_path": "/static/docs/dapartment_data/math_newsletter.pdf",
        "about_department": ["Since 1995, the department continues to provide mathematical skill and analytical thinking to all engineering and science graduates of this institution. Our aim is primarily on teaching and evenly on research also. The department has the faculty strength of 18 members includes 6 doctorates and 5 pursuing having an average teaching experience of 15 years. The department also trains engineering students in strong mathematical background to enhance and apply their skills to find solutions to their field specific problems. The department is a recognized nodal Centre for research under Anna University, Chennai.."]
    },
    {
        "department_id": "013",
        "department_name": "Mechancial Engineering (MECH)",
        "department_image": "/static/images/department_data/mech.jpg",
        "department_quotes": "Quality and consistency are not an accident; it's the result of high intention, sincere effort, intelligent direction, and skillful execution.",
        "vision": "Producing competent Mechanical Engineers by imparting quality education blended with human values, as potential contributors to the industrial development of the nation leading to the well being of the future generation.",
        "mission": [
            "Imparting quality education to the students in core areas with moral values through our dedicated team.",
            "Promoting research and development by giving hands on experience of state of the art facilities.",
            "Providing platform for the students to explore their innovative and creative skills.",
            "Promoting activities to cultivate the spirit of entrepreneurship to the students.",
            "Empowering the students in organizing events to gain experience in team work and leadership qualities.",
            "Preparing the students for their role as Engineers in society with an awareness of ethical, environmental, economic, safety and quality issues"
        ],
        "newsletter_path": "/static/docs/dapartment_data/mech_newsletter.pdf",
        "about_department": ["Mechanical Engineering is the only branch of engineering that can fit into any kind of industries, is the oldest engineering disciplines and an extremely diverse profession. Mechanical engineers are inherently multi-disciplinary and having wide range of career choices. Manufacturing has emerged as one of the high growth sectors in India.  Government aims to create 100 million new jobs in the sector in near future.The Department of Mechanical Engineering at Velammal Engineering College, Chennai started its journey in the year 1999. We have a strong undergraduate program in mechanical engineering. The Department has a distinguished record in both teaching and research. The Department is committed to provide knowledge creation, innovation and research among the students to meet challenges in Mechanical Engineering Field.  Minor degree in the area of Electric vehicle Technology and Data Science, and honours degree in the area of Robotics and Automation are offered to Mechanical Engineering Students.The department is accredited by National Board of Accreditation (NBA), New Delhi is recognized as the Nodal Research Centre by Anna University, Chennai.  Our Alumni play key role in different industrial, academic and Government organizations. The department providing value based holistic development for each student."]
    },
    {
        "department_id": "014",
        "department_name": "தமிழ்த்துறை",
        "department_image": "/static/images/department_data/physical.jpg",
        "department_quotes": "தமிழ் எங்கள் சமூகத்தின் விளைவுக்கு நீர்!",
        "vision": "தமிழரின் பண்பாட்டு விழுமியங்களைக் கற்று வாழ்நாள் முழுவதும் பயன்படுத்துதல். பொறியியல் துறைகளில் தமிழரின் அறிவியல் மற்றும் தொழில்நுட்பச் சிந்தனைகளை ஆய்ந்து மரபார்ந்த புத்தாக்கங்களைப் படைத்தல் ஆகிய இரு இலக்குகளைத் தமிழ்த்துறை தொலைநோக்காகக் கொண்டுள்ளது.",
        "mission": [
            "தமிழரின் வளமான பாரம்பரிய பண்பாட்டுக் கூறுகளைத் தெரிந்து கொள்ளச் செய்தல்.",
            "பொறியியல் தொழில்நுட்பக் கூறுகளை அறிந்து கொள்ளச் செய்தல்.",
            "மொழித்திறன் மற்றும் படைப்பாற்றலை வளர்த்தல்.",
           "சமூகத்திற்குப் பயனளிக்கும் வகையில் ஒழுக்கமும் ஆளுமைத்திறனும் உடையவர்களாக உருவாக்குதல்." 
        ],
        "newsletter_path": "/static/docs/dapartment_data/physical_newsletter.pdf",
        "about_department": ["தமிழர்களின் வளமான பண்பாடு, கலை, கலாச்சாரம், இலக்கியம், அறிவியல் சிந்தனைகள், பொறியியல் தொழில்நுட்பத் தகவல்கள் முதலானவற்றை மாணவர்கள் கற்கும் நோக்கில் ‘தமிழர் மரபு’ மற்றும் தமிழர் தொழில்நுட்பம்’ ஆகிய இரண்டு தனித்துவமான பாடங்களைக் கற்பிப்பதனை நோக்கமாகக் கொண்டு 2023 ஆம் ஆண்டு முதல் தமிழ்த்துறை இயங்கிவருகிறது."," மேலும் இத்துறை, மாணவர்கள் மொழி, ஆளுமைத்திறன், புதுமை படைத்தல், வாழ்வியல் அறநெறி மற்றும் பண்பாட்டு மாண்புகளைப் பெற்று, சமூகத்தோடு கூடி வாழ வழிகாட்டுகிறது."]
    },
    {
        "department_id": "015",
        "department_name": "Physics",
        "department_image": "/static/images/department_data/physics.jpg",
        "department_quotes": "Harnessing life sciences for a better tomorrow.",
        "vision": "To lead in biotechnology education and research for sustainable development.",
        "mission": [
            "Provide comprehensive knowledge in biotechnology.",
            "Encourage research in genetic engineering and bioprocess technology.",
            "Prepare students for global challenges in biotechnology and healthcare."
        ],
        "newsletter_path": "/static/docs/dapartment_data/physics_newsletter.pdf",
        "about_department": ["Department of Artificial Intelligence aims to produce computing graduates with high potency, apply, design and develop systems to pertain and to integrate both software and hardware devices, utilize modern approaches in programming and problem solving techniques."," The Department was established in the year 2020 with the main objective of providing quality education in the field of Engineering and Technology."," It is recognized as nodal center under Anna University. The Department has proved to be a center of excellence in Academic, Sponsored research and Continuing Education Programme."]
    },
    {
        "department_id": "016",
        "department_name": "M.E Computer Science Engineering",
        "department_image": "/static/images/department_data/mecse.jpg",
        "department_quotes": "Harnessing life sciences for a better tomorrow.",
        "vision": "To provide quality education aimed at cultivating exceptionally skilled technologists and entrepreneurs with a global footprint, supported by strong ethical values, and inventive thinking in the field of Computer Science and Engineering, tailored to fulfill both industrial demands and societal aspirations",
        "mission": [
            "To focus on delivering education that is both affordable and of high quality, ensuring that it aligns with current industry needs. ",
            "To strive for excellence in teaching and learning processes by integrating strong ethical values, inventive thinking, and a focus on entrepreneurship.",
            "To create an environment that encourages innovation supports multidisciplinary research endeavors, and cultivates professionals focused on research excellence in Computer Science and Engineering. ",
            "To enhance educational outcomes by nurturing entrepreneurship, integrating project-based learning, and aligning educational efforts with both industrial demands and societal aspirations."
        ],
        "newsletter_path": "/static/docs/dapartment_data/physics_newsletter.pdf",
        "about_department": ["Computer Science and Engineering plays a vital role in helping organizations to achieve profitable results and keep competitive forces in check. Keeping this objective in mind, young mindsets are educated here with full academic rigor to convert them into effective IT professionals. The de-partment is instrumental in conducting various technical and non-technical activities for students as well as faculty members. The focus is not only technical stuff on but also moral values, ethics, professionalism and so. Regular classes of the latest technologies are being conducted for stu-dents. On a continuous basis, students are made aware of the latest industry trends and needs in various technological domains. Well-motivated, competent faculty members are always engaged in student’s welfare. Encouragement and guidance is offered to the students for participating in sports and various extracurricular activities to highlight and strengthen their nontechnical skills. Our academic rigor, Plan Do Check Act approach in all sorts of aspects has made this department to be a one of the best choices for UG, PG and PhD admission aspirants. The industry inputs are taken into consideration in each and every course. The Curriculum has features like Industry con-nect, research associations, semester-long internship, live industry problem-solving, electives, open elective, honors and minor degree to support an interdisciplinary approach."]
    },
    {
        "department_id": "017",
        "department_name": "Master of Business Administration (MBA)",
        "department_image": "/static/images/department_data/mba.jpg",
        "department_quotes": "Harnessing life sciences for a better tomorrow.",
        "vision": "Educate with Global Exposure, Enhance Research Knowledge and Energize Entrepreneurial Spirit.",
        "mission": [
            "To become a world class institution of higher learning renowned for its excellence in management and for its commitment to the holistic development of the individual and society by creating a novel approach to students through education and industry practice by encouraging value-based knowledge, thus creating a goodwill to the future generation of our country."
        ],
        "newsletter_path": "/static/docs/dapartment_data/physics_newsletter.pdf",
        "about_department": ["The Department of Management Sciences (DoMS) is committed to nurturing learners into Champions, Mindful Leaders, Entrepreneurial Managers, and Innovators. With this vision, inspired by the ideology of its founder, DoMS was established in 2007."," The department is on a transformative journey to become a B-School of excellence, embracing modern learning methodologies and an outcome-based approach.", "It has implemented a choice-based credit system, a case discussion courtyard, and a hybrid learning model that integrates Bloom's taxonomy on knowledge levels."]
    }
]