{
    "image_path":["/static/images/sports_achievemets/1.jpeg","/static/images/sports_achievemets/2.jpeg","/static/images/sports_achievemets/3.jpeg","/static/images/sports_achievemets/4.jpeg","/static/images/sports_achievemets/5.jpeg","/static/images/sports_achievemets/6.jpeg","/static/images/sports_achievemets/7.jpeg","/static/images/sports_achievemets/8.jpeg","/static/images/sports_achievemets/9.jpeg","/static/images/sports_achievemets/10.jpeg","/static/images/sports_achievemets/11.jpeg","/static/images/sports_achievemets/12.jpeg","/static/images/sports_achievemets/13.jpeg","/static/images/sports_achievemets/14.jpeg","/static/images/sports_achievemets/15.jpeg","/static/images/sports_achievemets/16.jpeg","/static/images/sports_achievemets/17.jpeg","/static/images/sports_achievemets/18.jpeg","/static/images/sports_achievemets/19.jpeg","/static/images/sports_achievemets/20.jpeg","/static/images/sports_achievemets/21.jpeg","/static/images/sports_achievemets/22.jpeg","/static/images/sports_achievemets/23.jpeg","/static/images/sports_achievemets/24.jpeg","/static/images/sports_achievemets/25.jpeg"],
    "title":["ANNA UNIVERSITY ZONAL CHESS MEN AND WOMEN WINNER MATCH HELD AT SRIRAM ENGG COLLEGE ON 22.09.23","ANNA UNIVERSITY ZONAL TABLE TENNIS MEN RUNNER MATCH HELD AT SA ENGG COLLEGE ON 26.09.23","ANNA UNIVERSITY ZONAL BADMINTON WOMEN RUNNER MATCH HELD AT VEC ENGG COLLEGE ON 04.10.23","ANNA UNIVERSITY ZONAL HOCKEY MEN WINNER MATCH HELD AT GRT ENGG COLLEGE ON 12.10.23","ANNA UNIVERSITY ZONAL FOOTBALL MEN WINNER MATCH HELD AT VEL TECH ENGG COLLEGE ON 11.10.23","ANNA UNIVERSITY ZONAL VOLLEYBALL MEN THIRD MATCH HELD AT PRATHYUSHA ENGG COLLEGE ON 27&amp;28.10.23","Our college student INDIRA KUMAR of 3rd year Mech secured Gold medal in the Event of Kumite and Silver medal in the event of Kata at 1st INTERNATIONAL OKINAWA GOJU-RYU KARATE OPEN CHAMPIONSHIP held at Coimbatore on 13.10.23 to 15.10.23.","Our college student S.R.Rupak of BE.EIE II year secured gold medals in three events of Anna university Inter Zonal Taekwondo tournament held at Govt.College of Engineering Bargur on 21.10.23.","Our college student G.Ajith of B.Tech.AI&amp;DS I year secured Gold medal in Individual event of Anna University Inter Zonal Taekwondo tournament held at Govt.College of Engineering Bargur on 21.10.23.","ANNA UNIVERSITY ZONAL CRICKET MEN THIRD MATCH HELD AT VEL TECH ENGG COLLEGE","ANNA UNIVERSITY ZONAL BASKETBALL WOMEN RUNNER MATCH HELD AT SA ENGG COLLEGE ON 02.11.23","ANNA UNIVERSITY ZONAL BALLBADMINTON WOMEN RUNNER MATCH HELD AT SA ENGG COLLEGE ON 07.11.23","ANNA UNIVERSITY ZONAL ATHLETICS WOMEN OVERALL RUNNER MATCH HELD AT GRT ENGG COLLEGE ON 24, 25.11.23","Anna University Inter zone Boxing competition our college student Miss T. Keerthana Lakshmi of I year Civil secure Gold medal and qualified for represent Anna University all India inter university boxing tournament to be held Chandigarh University Mohali.","Mr.Vijeya Venkatathri (Fencing)  of our passed out students received Best sports men award of our Honourable sports Minister Thiru.Udhaya Nithi Stalin.","Miss.Sathyapriya (Taekwondo) of our passed out students received Best sports men award of our Honourable sports Minister Thiru.Udhaya Nithi Stalin.","Our college student Miss T. Keerthana Lakshmi of I year Civil qualified for KHELO INDIA UNIVERSITY GAMES 2024","SVCE Trophy Volleyball our College team secure Third position","Our college student Miss T. Keerthana Lakshmi of I year Civil secure Gold in BFI talent Hunt Boxing tournament held at Bangalore.","ANNA UNIVERSITY ZONAL HANDBALL MEN RUNNER MATCH HELD AT ST.PETERS ENGG COLLEGE AVADI ON 11.03.2024","Our College students S.R.Rupak of II year EIE and G.Ajith of I year AI qualified for represent Anna University All India Inter University Taekwondo tournament to be held at Shri JagdishPrasad Jhabarmal Tibre Wala University Jhunjhunu Rajasthan.","Anna University Inter zone Boxing competition our college student Miss T. Keerthana Lakshmi of I year Civil secure Gold medal and qualified for represent Anna University all India inter university boxing tournament to be held Chandigarh University Mohali and Qualified for KHELO INDIA UNIVERSITY GAMES 2024.","Congratulations to our students J. Nitish Kumar of 1st year B.TECH IT and R. Rohit Valavan of 1st Year CSE to participating Between the All India Inter University championship held at Bangalore University from 13/05/24 to 18/05/24.","ANNA UNIVERSITY ZONAL KHO KHO MEN WINNER MATCH HELD AT PRATHYUSHA ENGG COLLEGE ON 16.03.24"]
}